--TASK 1

--Сделать запрос для получения атрибутов из указанных таблиц, применив фильтры по указанным условиям:
--Таблицы: Н_ЛЮДИ, Н_СЕССИЯ.
--Вывести атрибуты: Н_ЛЮДИ.ОТЧЕСТВО, Н_СЕССИЯ.ДАТА.
--Фильтры (AND):
--a) Н_ЛЮДИ.ФАМИЛИЯ < Петров.
--b) Н_СЕССИЯ.ЧЛВК_ИД > 100622.
--Вид соединения: LEFT JOIN.

SELECT "Н_ЛЮДИ"."ОТЧЕСТВО", "Н_СЕССИЯ"."ДАТА" 
  FROM "Н_ЛЮДИ" 
  LEFT JOIN "Н_СЕССИЯ" 
  ON "Н_ЛЮДИ"."ИД"="Н_СЕССИЯ"."ЧЛВК_ИД" 
  WHERE "Н_ЛЮДИ"."ФАМИЛИЯ"<'Петров' AND "Н_СЕССИЯ"."ЧЛВК_ИД">100622;


--TASK 2

--Сделать запрос для получения атрибутов из указанных таблиц, применив фильтры по указанным условиям:
--Таблицы: Н_ЛЮДИ, Н_ОБУЧЕНИЯ, Н_УЧЕНИКИ.
--Вывести атрибуты: Н_ЛЮДИ.ИМЯ, Н_ОБУЧЕНИЯ.ЧЛВК_ИД, Н_УЧЕНИКИ.ИД.
--Фильтры: (AND)
--a) Н_ЛЮДИ.ИД < 163484.
--b) Н_ОБУЧЕНИЯ.ЧЛВК_ИД = 105590.
--c) Н_УЧЕНИКИ.ИД < 1.
--Вид соединения: RIGHT JOIN.
SELECT "Н_ЛЮДИ"."ИМЯ", "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД" FROM "Н_ЛЮДИ" 
  RIGHT JOIN "Н_ОБУЧЕНИЯ" ON "Н_ЛЮДИ"."ИД"="Н_ОБУЧЕНИЯ"."ЧЛВК_ИД" 
  RIGHT JOIN "Н_УЧЕНИКИ" ON "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД"="Н_УЧЕНИКИ"."ЧЛВК_ИД" 
  WHERE "Н_ЛЮДИ"."ИД"<163484 AND "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД"="105590" AND "Н_УЧЕНИКИ"."ИД"<1;
--


--Task 3

--Вывести число студентов ФКТИУ, которые старше 25 лет.
--Ответ должен содержать только одно число.

SELECT COUNT(*) 
  FROM "Н_ЛЮДИ" 
  WHERE (CASE WHEN "Н_ЛЮДИ"."ДАТА_СМЕРТИ" > current_date 
            THEN EXTRACT(YEAR FROM AGE(current_date, "Н_ЛЮДИ"."ДАТА_РОЖДЕНИЯ")) > 25  
            ELSE EXTRACT(YEAR FROM AGE("Н_ЛЮДИ"."ДАТА_СМЕРТИ", "Н_ЛЮДИ"."ДАТА_РОЖДЕНИЯ")) > 25 
       END) AND "Н_ЛЮДИ"."ДАТА_РОЖДЕНИЯ"<current_date
  AND "Н_ЛЮДИ"."ИД" IN (
    SELECT DISTINCT "Н_УЧЕНИКИ"."ЧЛВК_ИД" 
    FROM "Н_УЧЕНИКИ" 
    JOIN "Н_ПЛАНЫ"
    ON "Н_УЧЕНИКИ"."ПЛАН_ИД"="Н_ПЛАНЫ"."ИД" 
    WHERE "Н_ПЛАНЫ"."ОТД_ИД" IN (
      SELECT "ИД" FROM "Н_ОТДЕЛЫ" 
      WHERE "КОРОТКОЕ_ИМЯ"='КТиУ'
    )
);



--TASK 4 old
SELECT "Н_ЛЮДИ"."ОТЧЕСТВО", COUNT(*) 
  FROM "Н_ЛЮДИ"
  WHERE "Н_ЛЮДИ"."ОТЧЕСТВО" IN (
    SELECT "Н_ЛЮДИ"."ОТЧЕСТВО" 
      FROM (
        SELECT "Н_ЛЮДИ"."ОТЧЕСТВО" 
        FROM "Н_ЛЮДИ" 
        WHERE "Н_ЛЮДИ"."ИД" IN (
          SELECT DISTINCT "Н_УЧЕНИКИ"."ЧЛВК_ИД" 
          FROM "Н_УЧЕНИКИ" 
          LEFT JOIN "Н_ПЛАНЫ" ON "Н_УЧЕНИКИ"."ПЛАН_ИД"="Н_ПЛАНЫ"."ИД" 
          WHERE "Н_ПЛАНЫ"."ОТД_ИД" IN (SELECT "ИД" FROM "Н_ОТДЕЛЫ" WHERE "КОРОТКОЕ_ИМЯ"='ВТ')
        )
      ) 
  GROUP BY "Н_ЛЮДИ"."ОТЧЕСТВО" HAVING COUNT("Н_ЛЮДИ"."ОТЧЕСТВО")>50
);


--TASK 4

--Выдать различные отчества студентов и число людей с каждой из этих отчеств, ограничив список отчествами, встречающимися более 50 раз на кафедре вычислительной техники.
--Для реализации использовать подзапрос.
SELECT "ОТЧЕСТВО", COUNT(*) 
  FROM "Н_ЛЮДИ" 
  WHERE "ОТЧЕСТВО" IN (
    SELECT "ОТЧЕСТВО" 
      FROM (
        SELECT "ОТЧЕСТВО" 
        FROM "Н_ЛЮДИ" 
        WHERE "ИД" IN (
          SELECT DISTINCT "ЧЛВК_ИД" 
          FROM "Н_УЧЕНИКИ" 
          WHERE "ПЛАН_ИД" in (
            SELECT "ИД" 
            FROM "Н_ПЛАНЫ" 
            WHERE "НАПС_ИД" IN (
              SELECT "ИД" 
              FROM "Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ" 
              WHERE "НС_ИД" IN(
                SELECT "ИД" 
                FROM "Н_НАПР_СПЕЦ" 
                WHERE lower("НАИМЕНОВАНИЕ")=('информатика и вычислительная техника')
              )
            )
          )
        )
      ) 
  GROUP BY "ОТЧЕСТВО" HAVING COUNT("ОТЧЕСТВО")>50)
GROUP BY "ОТЧЕСТВО";

--TASK 5

--Выведите таблицу со средним возрастом студентов во всех группах (Группа, Средний возраст), где средний возраст равен среднему возрасту в группе 3100.
WITH  group_and_ages AS (
  SELECT "ГРУППА",
      (CASE WHEN "Н_ЛЮДИ"."ДАТА_СМЕРТИ" > current_date 
            THEN EXTRACT(YEAR FROM AGE(current_date, "Н_ЛЮДИ"."ДАТА_РОЖДЕНИЯ"))  
            ELSE EXTRACT(YEAR FROM AGE("Н_ЛЮДИ"."ДАТА_СМЕРТИ", "Н_ЛЮДИ"."ДАТА_РОЖДЕНИЯ")) 
       END) as age
      FROM "Н_ЛЮДИ" 
      JOIN "Н_УЧЕНИКИ" 
      ON "Н_ЛЮДИ"."ИД"="Н_УЧЕНИКИ"."ЧЛВК_ИД" 
      WHERE "ДАТА_РОЖДЕНИЯ"<current_date)

SELECT "ГРУППА", AVG("age") 
  FROM group_and_ages
  GROUP BY ГРУППА 
  HAVING AVG("age")=(
    SELECT AVG("age") 
    FROM group_and_ages 
    WHERE "ГРУППА"='3100' 
    GROUP BY "ГРУППА"
  );

--
SELECT "ГРУППА", AVG("age") 
  FROM (
    SELECT "ГРУППА", 
      (CASE WHEN "Н_ЛЮДИ"."ДАТА_СМЕРТИ" > current_date 
            THEN EXTRACT(YEAR FROM AGE(current_date, "Н_ЛЮДИ"."ДАТА_РОЖДЕНИЯ"))  
            ELSE EXTRACT(YEAR FROM AGE("Н_ЛЮДИ"."ДАТА_СМЕРТИ", "Н_ЛЮДИ"."ДАТА_РОЖДЕНИЯ")) 
       END) as age
    FROM "Н_ЛЮДИ" 
    JOIN "Н_УЧЕНИКИ" 
    ON "Н_ЛЮДИ"."ИД"="Н_УЧЕНИКИ"."ЧЛВК_ИД" 
    WHERE "ДАТА_РОЖДЕНИЯ"<current_date
  ) 
  GROUP BY "ГРУППА" 
  HAVING AVG("age")=(
    SELECT AVG("age") 
    FROM (
        SELECT "ГРУППА", 
          (CASE WHEN "Н_ЛЮДИ"."ДАТА_СМЕРТИ" > current_date 
            THEN EXTRACT(YEAR FROM AGE(current_date, "Н_ЛЮДИ"."ДАТА_РОЖДЕНИЯ"))  
            ELSE EXTRACT(YEAR FROM AGE("Н_ЛЮДИ"."ДАТА_СМЕРТИ", "Н_ЛЮДИ"."ДАТА_РОЖДЕНИЯ")) 
           END) as age
        FROM "Н_ЛЮДИ" 
        JOIN "Н_УЧЕНИКИ" 
        ON "Н_ЛЮДИ"."ИД"="Н_УЧЕНИКИ"."ЧЛВК_ИД" 
        WHERE "ДАТА_РОЖДЕНИЯ"<current_date
    ) 
    WHERE "ГРУППА"='3100' 
    GROUP BY "ГРУППА");

--
SELECT "ГРУППА", AVG("age") 
  FROM (
    SELECT "ГРУППА", 
      (CASE WHEN "Н_ЛЮДИ"."ДАТА_СМЕРТИ" > current_date 
            THEN EXTRACT(YEAR FROM AGE(current_date, "Н_ЛЮДИ"."ДАТА_РОЖДЕНИЯ"))  
            ELSE EXTRACT(YEAR FROM AGE("Н_ЛЮДИ"."ДАТА_СМЕРТИ", "Н_ЛЮДИ"."ДАТА_РОЖДЕНИЯ")) 
       END) as age
    FROM "Н_ЛЮДИ" 
    JOIN "Н_УЧЕНИКИ" 
    ON "Н_ЛЮДИ"."ИД"="Н_УЧЕНИКИ"."ЧЛВК_ИД" 
    WHERE "ДАТА_РОЖДЕНИЯ"<current_date) 
    GROUP BY "ГРУППА" 
    HAVING ROUND(AVG("age"), 2)=ROUND(
      (
        SELECT AVG("age") 
        FROM (
          SELECT "ГРУППА", 
            (CASE WHEN "Н_ЛЮДИ"."ДАТА_СМЕРТИ" > current_date 
            THEN EXTRACT(YEAR FROM AGE(current_date, "Н_ЛЮДИ"."ДАТА_РОЖДЕНИЯ"))  
            ELSE EXTRACT(YEAR FROM AGE("Н_ЛЮДИ"."ДАТА_СМЕРТИ", "Н_ЛЮДИ"."ДАТА_РОЖДЕНИЯ")) 
             END) as age
          FROM "Н_ЛЮДИ" 
          JOIN "Н_УЧЕНИКИ" 
          ON "Н_ЛЮДИ"."ИД"="Н_УЧЕНИКИ"."ЧЛВК_ИД" 
          WHERE "ДАТА_РОЖДЕНИЯ"<current_date
        ) 
        WHERE "ГРУППА"='3100' 
        GROUP BY "ГРУППА"
      ), 
  2);


--TASK 6

--Получить список студентов, зачисленных ровно первого сентября 2012 года на первый курс заочной формы обучения. В результат включить:
--номер группы;
--номер, фамилию, имя и отчество студента;
--номер и состояние пункта приказа;
--Для реализации использовать подзапрос с IN.
SELECT 
    "Н_УЧЕНИКИ"."ГРУППА",
    "Н_ЛЮДИ"."ИД",
    "Н_ЛЮДИ"."ФАМИЛИЯ",
    "Н_ЛЮДИ"."ИМЯ",
    "Н_ЛЮДИ"."ОТЧЕСТВО",
    "Н_УЧЕНИКИ"."СОСТОЯНИЕ",
    "Н_УЧЕНИКИ"."В_СВЯЗИ_С"
FROM "Н_ЛЮДИ",
     "Н_УЧЕНИКИ"
WHERE "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
  AND "Н_УЧЕНИКИ"."ПЛАН_ИД" IN (
        SELECT "Н_ПЛАНЫ"."ИД"
        FROM "Н_ПЛАНЫ"
        WHERE "Н_ПЛАНЫ"."ФО_ИД" IN (
                SELECT "Н_ФОРМЫ_ОБУЧЕНИЯ"."ИД"
                FROM "Н_ФОРМЫ_ОБУЧЕНИЯ"
                WHERE lower("Н_ФОРМЫ_ОБУЧЕНИЯ"."НАИМЕНОВАНИЕ") = 'заочная'
        )AND "Н_ПЛАНЫ"."КУРС" = 1
  )
  AND "Н_УЧЕНИКИ"."НАЧАЛО" = '2012-09-01'::timestamp;



--TASK 7

--Вывести список людей, не являющихся или не являвшихся студентами ФКТИУ (данные, о которых отсутствуют в таблице Н_УЧЕНИКИ). В запросе нельзя использовать DISTINCT.
SELECT * FROM "Н_ЛЮДИ" 
  WHERE "Н_ЛЮДИ"."ИД" NOT IN (
    SELECT "Н_УЧЕНИКИ"."ЧЛВК_ИД" 
    FROM "Н_УЧЕНИКИ" 
    JOIN "Н_ПЛАНЫ" 
    ON "Н_УЧЕНИКИ"."ПЛАН_ИД"="Н_ПЛАНЫ"."ИД" 
    WHERE "Н_ПЛАНЫ"."ОТД_ИД" IN (
      SELECT "ИД" FROM "Н_ОТДЕЛЫ" WHERE "КОРОТКОЕ_ИМЯ"='КТиУ'
    )
  );

SELECT "Н_ЛЮДИ"."ИД", "Н_ЛЮДИ"."ИМЯ", "Н_ЛЮДИ"."ФАМИЛИЯ", "Н_ЛЮДИ"."ОТЧЕСТВО", "Н_ОТДЕЛЫ"."ИД" 
  FROM "Н_ЛЮДИ"
    LEFT JOIN "Н_УЧЕНИКИ" 
  ON "Н_ЛЮДИ"."ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД"
    LEFT JOIN "Н_ПЛАНЫ" 
  ON "Н_УЧЕНИКИ"."ПЛАН_ИД" = "Н_ПЛАНЫ"."ИД"
    LEFT JOIN "Н_ОТДЕЛЫ" 
  ON ("Н_ПЛАНЫ"."ОТД_ИД" = "Н_ОТДЕЛЫ"."ИД" AND "Н_ОТДЕЛЫ"."КОРОТКОЕ_ИМЯ" = 'КТиУ')
  WHERE "Н_ОТДЕЛЫ"."ИД" IS NULL;
