echo "ЗАДАНИЕ 1: Рекурсивно подсчитать количество строк содержимого файлов из директории lab0, "
echo "имя которых начинается на 'l', отсортировать вывод по увеличению количества, подавить вывод ошибок доступа"
grep -r -c "^" lab0 --include="*/l*" 2>/dev/null | sort -k2,2n
echo

echo "ЗАДАНИЕ 2: Вывести рекурсивно список имен и атрибутов файлов в директории lab0, "
echo "заканчивающихся на символ 't', список отсортировать по имени z->a, подавить вывод ошибок доступа"
ls -lR lab0 2>/dev/null | grep "^-" | grep -E "t$" | sort -k9r
echo

echo "ЗАДАНИЕ 3: Рекурсивно вывести содержимое файлов с номерами строк из директории lab0,"
echo "имя которых заканчивается на 'e', строки отсортировать по имени a->z, добавить вывод ошибок доступа в стандартный поток вывода"
cat -n $(ls -d -R lab0/* lab0/*/* lab0/*/*/* 2>&1 | grep "e$" | sort -k4,4 -k3,3 -k2,2 -k1,1) 2>&1
echo

echo "ЗАДАНИЕ 4: Вывести список имен файлов в директории charizard0, "
echo "список отсортировать по имени a->z, ошибки доступа не подавлять и не перенаправлять"
ls -1 lab0/charizard0 | sort
echo

echo "ЗАДАНИЕ 5: Вывести четыре последних элемента рекурсивного списка имен и атрибутов файлов"
echo " в директории lab0, список отсортировать по возрастанию количества жестких ссылок, ошибки доступа не подавлять и не перенаправлять"
ls -lR lab0 | grep "^-" | sort -k2,2n | tail -n 4
echo

echo "ЗАДАНИЕ 6: Вывести два последних элемента рекурсивного списка имен и атрибутов файлов"
echo "в директории lab0, содержащих строку la, список отсортировать по убыванию количества жестких ссылок, подавить вывод ошибок доступа"
ls -lR lab0 2>/dev/null | grep "^-" | grep "la" | sort -k2,2nr | tail -n 2


